{
  "welcomeToUse": "Welcome to use",
  "desc": "Do you want to use a technology stack to develop a full stack web project? Perhaps you can try NextJS, but I think NextJS is only suitable for writing clients that require SSR. Using it to write API interfaces lacks many out of the box features, unlike NestJS. Additionally, if the backend management system is also written in the SSR framework, it is not as smooth as directly writing single page projects. If that's the case, then we all want it! This is a set of development templates for web full stack projects, including client (NextJS), backend management (React + Vite), and server (NestJS) code. All three sides are developed using Typescript, and monorepo isomorphic development is carried out using NX. This way, both the frontend and backend can use some common logic. For details, you can click below to view the GitHub repository.",
  "github": "Github repository",
  "projectManager": "Project Manager",
  "projectManagerDesc": "Use NX to manage the entire project code, allowing the front-end and back-end code to be isomorphic and enabling one click launch of the entire project.",
  "client": "Client",
  "clientDesc": "The client may require SEO functionality, so the default is to use NextJS to build it directly.",
  "managementEnd": "Management End",
  "managementEndDesc": "Most of the pages in the backend management system do not require SEO and can be directly built using React+Vite as a single page application.",
  "server": "Server",
  "serverEnd": "The server is built using NestJS, which provides more out of the box functionality for building APIs than NextJS.",
  "quickStart": "Quick Start",
  "mode1": "Mode One",
  "goDirectlyTo": "Go directly to",
  "downloadTheProjectLocally": "download the project locally.",
  "mode2": "Mode Two",
  "installTheDownloadTools": "install the download tools",
  "toolsDesc1": "After installation, use ying to execute the crt command, followed by the project name.",
  "projectName": "project name",
  "toolsDesc2": "Use the default username and then select the ying-starter project.",
  "toolsDesc3": "请输入 Github 用户名 JackDeng666",
  "toolsDesc4": "请选择仓库 ying-starter",
  "frequentlyAskedQuestion": "Frequently asked question",
  "question1": "1. When modifying code and moving files, do errors often occur (such as xxx project graph errors)?",
  "answer1": "Delete the .nx and tmp folders in the root directory, and then restart."
}
